
# Workflow Practice

In this notebook, you’ll practice connecting to a SQLite database, creating tables from CSV files using Pandas, and writing SQL queries to explore the data.

The dataset comes from the [Bike Store Sample Database](https://www.kaggle.com/datasets/dillonmyrick/bike-store-sample-database) by Dillon Myrick. It models a fictional bike retailer with multiple stores, products, customers, and staff. Each table connects to others using foreign keys such as `customer_id`, `store_id`, and `product_id`.

You’ll:
- Connect to a local SQLite database
- Create tables using `pandas.to_sql()`
- Write and test SQL queries using `pd.read_sql()`

All of your work will take place directly in this notebook. Each question prompt is written below as a Markdown cell, followed by an empty code cell for you to write your query.


## Step 1: Connect to the Database

Run the following cell to connect to (or create) a SQLite database called `bike_store.db`.  
If the file doesn’t exist yet, SQLite will automatically create it.

In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("bike_store.db")
connection


## Step 2: Create Tables from CSV Files

The `data/` folder contains one CSV file per table.  
Use `pandas.read_csv()` and `DataFrame.to_sql()` to load each file into your database.

You only need to do this once.  
After that, you’ll be able to run queries against your newly created tables.

In [ ]:
# Example for one file
customers = pd.read_csv("data/customers.csv")
customers.to_sql("customers", connection, if_exists="replace", index=False)

3

In [111]:
# Repeat for all other files in the data folder, or use a loop.

# Loading brands.csv file 
customers = pd.read_csv("data/brands.csv")
customers.to_sql("brands", connection, if_exists="replace", index=False)

# Loading categories.csv file 
customers = pd.read_csv("data/categories.csv")
customers.to_sql("categories", connection, if_exists="replace", index=False)

# Loading orders_items.csv file 
customers = pd.read_csv("data/order_items.csv")
customers.to_sql("order_items", connection, if_exists="replace", index=False)

# Loading orders.csv file 
customers = pd.read_csv("data/orders.csv")
customers.to_sql("orders", connection, if_exists="replace", index=False)

# Loading products.csv file 
customers = pd.read_csv("data/products.csv")
customers.to_sql("products", connection, if_exists="replace", index=False)

# Loading staffs.csv file 
customers = pd.read_csv("data/staffs.csv")
customers.to_sql("staffs", connection, if_exists="replace", index=False)

# Loading stoks.csv file 
customers = pd.read_csv("data/stocks.csv")
customers.to_sql("stocks", connection, if_exists="replace", index=False)

# Loading stores.csv file 
customers = pd.read_csv("data/stores.csv")
customers.to_sql("stores", connection, if_exists="replace", index=False)

3

### Verify Your Tables

Run a query to make sure your tables were created successfully.

In [112]:

pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", connection)

          name
0    customers
1       brands
2   categories
3  order_items
4       orders
5     products
6       staffs
7       stocks
8       stores

## Step 3: Test a Simple Query

Before starting the exercises, confirm your connection and tables are working by previewing the first few rows of the `customers` table.

In [89]:

pd.read_sql("SELECT * FROM customers LIMIT 5;", connection)

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,Debra,Burks,None,debra.burks@yahoo.com,9273 Thorne Ave.,Orchard Park,NY,14127
1,2,Kasha,Todd,None,kasha.todd@yahoo.com,910 Vine Street,Campbell,CA,95008
2,3,Tameka,Fisher,None,tameka.fisher@aol.com,769C Honey Creek St.,Redondo Beach,CA,90278
3,4,Daryl,Spence,None,daryl.spence@aol.com,988 Pearl Lane,Uniondale,NY,11553
4,5,Charolette,Rice,(916) 381-6003,charolette.rice@msn.com,107 River Dr.,Sacramento,CA,95820

### Q1. List all customers and their cities.

Return the first name, last name, and city of each customer. Sort alphabetically by last name and then by first name.

In [ ]:
pd.read_sql("select first_name, last_name, city from customers order by last_name, first_name;", connection)

      first_name  last_name                 city
0          Ester    Acevedo          San Lorenzo
1         Jamika    Acevedo           Ozone Park
2          Penny    Acevedo         Ballston Spa
3       Bettyann     Acosta            Lancaster
4          Shery     Acosta     Saratoga Springs
...          ...        ...                  ...
1440        Edda      Young      North Tonawanda
1441      Jasmin      Young              Helotes
1442  Alexandria     Zamora          Schenectady
1443       Jayme     Zamora  Springfield Gardens
1444       Ollie  Zimmerman              Anaheim

[1445 rows x 3 columns]

### Q2. Show all products and their prices.

Display each product name along with its list price. Sort by price in descending order.

In [ ]:
pd.read_sql("SELECT product_name, list_price FROM products order by list_price desc;", connection)

                               product_name  list_price
0             Trek Domane SLR 9 Disc - 2018    11999.99
1             Trek Domane SLR 8 Disc - 2018     7499.99
2          Trek Silque SLR 8 Women's - 2017     6499.99
3            Trek Domane SL Frameset - 2018     6499.99
4    Trek Domane SL Frameset Women's - 2018     6499.99
..                                      ...         ...
316                    Trek Kickster - 2018      159.99
317         Trek Boy's Kickster - 2015/2017      149.99
318             Trek Girl's Kickster - 2017      149.99
319          Sun Bicycles Lil Kitt'n - 2017      109.99
320  Strider Classic 12 Balance Bike - 2018       89.99

[321 rows x 2 columns]

### Q3. Find all customers from California.

Return first name, last name, city, and state for all customers whose state is 'CA'. Sort alphabetically by last name.

In [ ]:
pd.read_sql("SELECT first_name, last_name, city, state FROM customers where state = 'CA';", connection)

     first_name last_name           city state
0         Kasha      Todd       Campbell    CA
1        Tameka    Fisher  Redondo Beach    CA
2    Charolette      Rice     Sacramento    CA
3        Corene      Wall        Atwater    CA
4        Jamaal    Albert       Torrance    CA
..          ...       ...            ...   ...
279      Carola     Johns     Santa Cruz    CA
280      Lorrie   Justice         Pomona    CA
281       Tayna      Wade    Bakersfield    CA
282         Lee      Dunn       San Jose    CA
283       Ester   Acevedo    San Lorenzo    CA

[284 rows x 4 columns]

### Q4. Count how many products are in each category.

Return the category name and the number of products in that category. Sort from the highest count to the lowest.

In [199]:
pd.read_sql("""
            SELECT c.category_name, count(p.product_id) as products_count 
            FROM categories c 
            LEFT JOIN products p on c.category_id = p.category_id 
            GROUP BY c.category_id , c.category_name 
            ORDER BY products_count desc;
            """, connection)

         category_name  products_count
0    Cruisers Bicycles              78
1       Mountain Bikes              60
2           Road Bikes              60
3    Children Bicycles              59
4     Comfort Bicycles              30
5       Electric Bikes              24
6  Cyclocross Bicycles              10

### Q5. Find all orders placed in 2018.

List the order ID, order date, and customer ID for orders made during the year 2018. Sort by order date.

In [ ]:
pd.read_sql("""
            SELECT order_id, order_date, customer_id from orders 
            WHERE order_date between '2018-01-01' and '2018-12-31' 
            ORDER BY order_date;
            """, connection)

     order_id  order_date  customer_id
0        1324  2018-01-01          862
1        1325  2018-01-01           68
2        1326  2018-01-01          567
3        1327  2018-01-02         1026
4        1328  2018-01-02         1083
..        ...         ...          ...
287      1611  2018-09-06            6
288      1612  2018-10-21            3
289      1613  2018-11-18            1
290      1614  2018-11-28          135
291      1615  2018-12-28          136

[292 rows x 3 columns]

### Q6. Show each order with its total number of items.

Join the `orders` and `order_items` tables. Group by order ID and return the number of items per order.

In [201]:
pd.read_sql("""
            SELECT o.order_id, count(oi.quantity) as QuantityItems_per_Order 
            FROM order_items oi 
            JOIN orders o on oi.order_id = o.order_id 
            GROUP BY oi.order_id;
            """, connection)

      order_id  QuantityItems_per_Order
0            1                        5
1            2                        2
2            3                        2
3            4                        1
4            5                        3
...        ...                      ...
1610      1611                        3
1611      1612                        5
1612      1613                        2
1613      1614                        3
1614      1615                        3

[1615 rows x 2 columns]

### Q7. List total revenue per store.

Revenue = quantity * list_price * (1 - discount). Join `orders`, `order_items`, and `stores`, group by store name, and return total revenue.

In [202]:
pd.read_sql("""
            SELECT st.store_name ,  round(sum(oi.quantity * oi.list_price * (1 - oi.discount)),2) as Total_Revenue
            FROM stores st 
            JOIN orders o on st.store_id = o.store_id 
            JOIN order_items oi on o.order_id = oi.order_id 
            GROUP BY st.store_id,st.store_name 
            ORDER BY Total_Revenue desc;
            """, connection)

         store_name  Total_Revenue
0     Baldwin Bikes     5215751.28
1  Santa Cruz Bikes     1605823.04
2     Rowlett Bikes      867542.24

### Q8. Find the top 5 customers who spent the most overall.

Join `customers`, `orders`, and `order_items`. Sum the total spending per customer and return the top five spenders.

In [203]:
pd.read_sql("""
            SELECT cu.customer_id, cu.first_name, cu.last_name, sum(oi.quantity * oi.list_price) as Order_Price 
            FROM customers cu 
            JOIN orders o on cu.customer_id = o.customer_id 
            JOIN order_items oi on oi.order_id = o.order_id group by o.order_id 
            ORDER BY Order_Price desc LIMIT 5;
            """, connection)

   customer_id first_name last_name  Order_Price
0           10    Pamelia    Newman     32328.92
1           73    Melanie     Hayes     29150.91
2           75       Abby    Gamble     28499.95
3          122      Shena    Carter     27618.95
4           94     Sharyn   Hopkins     26989.93

### Q9. Show the best-selling product in each category.

Join `products`, `order_items`, and `categories`. For each category, identify the product with the highest total quantity sold.

In [ ]:
pd.read_sql("""
    SELECT Category_Name, Product_Name, Total_Products_Sold
    FROM (
        SELECT c.category_name, p.product_name, sum(oi.quantity) as Total_Products_Sold,
        ROW_NUMBER () OVER (
            PARTITION BY c.category_name
            ORDER BY sum(oi.quantity) DESC
            ) AS rn
        FROM categories c 
        INNER JOIN products p ON c.category_id =p.category_id 
        INNER JOIN order_items oi ON p.product_id = oi.product_id 
        GROUP BY p.product_name, c.category_name
        )
    WHERE rn = 1;
    """, connection)

#pd.read_sql("select p.category_id, cat.category_name, p.product_name, sum(oi.quantity) as Total_Product from order_items oi join products p on oi.product_id= p.product_id join categories cat on p.category_id = cat.category_id group by oi.product_id,p.category_id order by Total_Product desc;", connection)

#pd.read_sql("select c.category_name,p.product_name, sum(oi.quantity) as Total_Product from categories c join products p on c.category_id =p.category_id join order_items oi on p.product_id = oi.product_id group by p.product_id, p.category_id order by Total_Product desc;", connection)

# select p.category_id,sum(oi.quantity) as product_quantity from  join order_items oi on oi.product_id=p.product_id join categories cat on cat.category_id = p.category_id group_by oi.product_id
#pd.read_sql("select .product_id, cat.category_name, sum( oi.quantity) as BestSelling_CategoryProduct from products p join order_items oi group by oi.product_id, cat.category_id order by BestSelling_CategoryProduct;", connection)

,category_name,product_name,Total_Products_Sold
0,Children Bicycles,Electra Girl's Hawaii 1 (20-inch) - 2015/2016,154
1,Comfort Bicycles,Electra Townie Original 7D - 2015/2016,148
2,Cruisers Bicycles,Electra Cruiser 1 (24-Inch) - 2016,157
3,Cyclocross Bicycles,Surly Straggler 650b - 2016,151
4,Electric Bikes,Trek Conduit+ - 2016,145
5,Mountain Bikes,Surly Ice Cream Truck Frameset - 2016,167
6,Road Bikes,Trek Domane SLR 6 Disc - 2017,43

### Q10. Identify the employees (staff) who processed the most orders.

Join `staffs` and `orders`. Count the number of orders handled by each staff member and return the results sorted by highest total.

In [198]:
pd.read_sql("""
        SELECT s.first_name, s.last_name, count(o.order_id) as Orders_Quantity 
        FROM staffs s 
        JOIN orders o ON s.staff_id = o.staff_id
        GROUP BY s.staff_id, s.first_name, s.last_name
        ORDER BY Orders_Quantity DESC;
        """, connection)

  first_name last_name  Orders_Quantity
0  Marcelene     Boyer              553
1     Venita    Daniel              540
2      Genna   Serrano              184
3     Mireya  Copeland              164
4       Kali    Vargas               88
5      Layla   Terrell               86